#+Startup: indent

#+OPTIONS: num:nil reveal_global_footer:t toc:nil reveal_history:t
#+PROPERTY: header-args :eval no-export

#+include: reveal_header.org :minlevel 1

#+Title: Emmy
#+Subtitle: Moldable Physics, Lispy Microworlds

* Core Idea: Generics
#+begin_notes
Let's talk about the code idea:

- generics + mathematical objects
- multimethods and protocols
- STAY GENERIC AS LONG AS POSSIBLE and then specialize
- then happily build little compilers inside your code
#+end_notes


"If a system is built as a ball of mud, it is easy to add more mud.

One organization for a ball of mud is a system erected on a substrate of
generically extensible procedures."

#+REVEAL_HTML: <small>~ Hanson and Sussman, Software Design for Flexibility</small>

#+REVEAL: split
#+begin_notes
As Kir said, impl is so easy...
- plus is already overloaded, so this opens it up
#+end_notes

#+begin_src clojure :results value pp :exports both
(+ 1 2)
#+end_src

#+RESULTS:
: 3
:

#+begin_src clojure :results value pp :exports both
(+ 1/2 1/3)
#+end_src

#+RESULTS:
: 5/6
:

#+begin_src clojure :results value pp :exports both
(+ 1 'x)
#+end_src

#+RESULTS:
: (+ 1 x)
:

#+begin_src clojure :results value pp :exports both
(transduce (map square) + ['x 'y 'z])
#+end_src
#+RESULTS:
: (+ (expt x 2) (expt y 2) (expt z 2))
:

#+REVEAL: split
#+begin_notes
- Works on weirder objects
- ball of mud
- puzzler at the end
#+end_notes
#+begin_src clojure :results value pp :exports both
(+ sin cos)
#+end_src

#+RESULTS:
: #function[clojure.lang.AFunction/1]
:

#+begin_src clojure :results value pp :exports both
((+ sin cos) 'x)
#+end_src

#+RESULTS:
: (+ (sin x) (cos x))
:

#+begin_src clojure :results value pp :exports both
((square [+ *]) 'x 'y)
#+end_src

#+RESULTS:
: (+ (* (+ x y) (+ x y)) (* x y x y))
:

#+REVEAL: split
#+begin_notes
- also comes with a powerful simplifier
- performance shimmers...
#+end_notes

#+begin_src clojure :results value pp :exports both
(defn unit-circle [angle]
  [(cos angle)
   (sin angle)])

(defn mag [thing]
  (sqrt (square thing)))
#+end_src

#+RESULTS:
: #'prez/mag
:

#+begin_src clojure :results value pp :exports both
((mag unit-circle) 'theta)
#+end_src

#+RESULTS:
: (sqrt (+ (* (cos theta) (cos theta)) (* (sin theta) (sin theta))))
:

#+begin_src clojure :results value pp :exports both
(simplify
 ((mag unit-circle) 'theta))
#+end_src

#+RESULTS:
: 1
:

#+REVEAL: split
#+begin_notes
- Hints of speed
- little compiler
#+end_notes

#+begin_src clojure :results value pp :exports both
(defn fast! [f]
  (let [sym  (gensym)
        body (f sym)]
    `(fn [~sym]
       ~(simplify body))))
#+end_src

#+RESULTS:
: #'prez/fast!
:

#+begin_src clojure :results value pp :exports both
(fast! (mag unit-circle))
#+end_src

#+RESULTS:
: (clojure.core/fn [G__79973] 1)
:

